HHyeon/stm32-connectivity/Projects/STM32H747I-DISCO/Applications/wifi_scan/Middlewares/Third_Party/Infineon_Wireless_Connectivity/connectivity-utilities/JSON_parser/cy_json_parser.c
/*
 * Copyright 2019-2021, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

/** @file
 *
 */
#include "cy_json_parser.h"
#include <stddef.h>
#include <string.h>

/******************************************************
 *                      Macros
 ******************************************************/

#define MAX_BACKUP_SIZE 500
#define MAX_PARENTS 4

/******************************************************
 *                    Constants
 ******************************************************/

/******************************************************
 *                   Enumerations
 ******************************************************/

/******************************************************
 *                 Type Definitions
 ******************************************************/

/******************************************************
 *                    Structures
 ******************************************************/

/******************************************************
 *               Static Function Declarations
 ******************************************************/

static cy_rslt_t validate_array_value( char* start, char* stop, uint8_t len );

/******************************************************
 *               Variable Definitions
 ******************************************************/
static cy_JSON_callback_t      internal_json_callback;
static void                    *internal_json_argument;

static char*               previous_token   = NULL;
static cy_JSON_object_t json_object =
{
    .object_string        = NULL,
    .object_string_length =                 0,
    .value_type           = UNKNOWN_JSON_TYPE,
    .value                = NULL,
    .value_length         =                 0,
    .parent_object        = NULL
};

static int32_t             parent_counter = 0;
static cy_JSON_object_t parent_json_object[ MAX_PARENTS ];

static bool        incomplete_response       = false;

static int32_t             object_counter            = 0;

static char*               string_start              = NULL;
static char*               string_end                = NULL;

static char*               value_start               = NULL;
static char*               value_end                 = NULL;

static cy_JSON_type_t      type                      = UNKNOWN_JSON_TYPE;

static char*               current_input_token;
static char*               end_of_input;

static char*               most_recent_object_marker = NULL;

char                       packet_backup[ MAX_BACKUP_SIZE ];

uint32_t                   number_of_bytes_backed_up;

static bool        escape_token              = false;
static int32_t             array_counter            = 0;

/******************************************************
 *               Function Definitions
 ******************************************************/
static cy_rslt_t validate_array_value( char* start, char* stop, uint8_t len )
{
    char*   temp = NULL;
    uint8_t e_count = 0;
    uint8_t dot = 0;
    uint8_t minus = 0;
    uint8_t plus = 0;

    /* TODO : Cases to be handled for example : e+-  e.+1  .e-+2  -1.234e-3  */

    if ( ( *start == 'f' ) && ( len == 5 ) )
    {
        if ( !strncmp( (const char*) start, "false", ( sizeof( "false" ) - 1 ) ) )
        {
            return CY_RSLT_SUCCESS;
        }
        else
        {
            return CY_RSLT_JSON_GENERIC_ERROR;
        }
    }
    if ( ( *start == 't' ) && ( len == 4 ) )
    {
        if ( !strncmp( (const char*) start, "true", ( sizeof( "true" ) - 1 ) ) )
        {
            return CY_RSLT_SUCCESS;
        }
        else
        {
            return CY_RSLT_JSON_GENERIC_ERROR;
        }
    }
    if ( ( *start == 'n' ) && ( len == 4 ) )
    {
        if ( !strncmp( (const char*) start, "null", ( sizeof( "null" ) - 1 ) ) )
        {
            return CY_RSLT_SUCCESS;
        }
        else
        {
            return CY_RSLT_JSON_GENERIC_ERROR;
        }
    }

    temp = start;
    while ( temp <= stop )
    {
        if( *temp == ' ')
        {
            temp++;
            continue;
        }
        if( *temp == '\n')
        {
            temp++;
            continue;
        }
        if( *temp == '\r')
        {
            temp++;
            continue;
        }

        switch ( *temp )
        {
            case 'e':
                e_count++;
                break;

