HHyeon/stm32-connectivity/Projects/STM32H747I-DISCO/Applications/wifi_scan/Middlewares/Third_Party/Infineon_Wireless_Connectivity/connectivity-utilities/JSON_parser/cy_json_parser.c
            case '+':
                plus++;
                break;

            case '-':
                minus++;
                break;

            case '.':
                dot++;
                break;

            default:
                break;
        }

        if ( !( ( ( *temp >= '0' ) && ( *temp <= '9' ) ) || ( *temp == 'e' ) || ( *temp == '-' ) || ( *temp == '.' ) || ( *temp == '+' ) ) )
        {
            return CY_RSLT_JSON_GENERIC_ERROR;
        }

        if ( ( e_count > 1 ) || ( minus > 1 ) || ( plus > 1 ) || ( dot > 1 ) )
        {
            return CY_RSLT_JSON_GENERIC_ERROR;
        }
        temp++;
    }

    return CY_RSLT_SUCCESS;
}


/* Register callbacks parser will use to populate fields*/
cy_rslt_t cy_JSON_parser_register_callback( cy_JSON_callback_t json_callback, void *arg )
{
    internal_json_callback = json_callback;
    internal_json_argument = arg;

    return CY_RSLT_SUCCESS;
}


/* Get current callback */
cy_JSON_callback_t cy_JSON_parser_get_callback( void )
{
    return internal_json_callback;
}


cy_rslt_t cy_JSON_parser( const char* json_input, uint32_t input_length )
{
    cy_rslt_t valid_json_string         = CY_RSLT_SUCCESS;
    int            space = 0;

    if ( incomplete_response )
    {
        // If there is enough room on backup buffer to hold new data and old backed up
        // data, parse the backup buffer
        if ( ( input_length + number_of_bytes_backed_up ) < MAX_BACKUP_SIZE )
        {
            memcpy( packet_backup + number_of_bytes_backed_up, json_input, input_length );
            current_input_token = packet_backup;
            end_of_input = current_input_token + number_of_bytes_backed_up + input_length;
        }
        else
        {
            // We must drop entire json object from last buffer. Find start of new json object
            // in new packet, and being parsing from there
            while ( *json_input != '{' )
            {
                json_input++;
                input_length--;
            }
            current_input_token = (char*) json_input;
            end_of_input        = current_input_token + input_length;
        }

        incomplete_response = false;
    }
    else
    {
        current_input_token = (char*) json_input;
        end_of_input        = current_input_token + input_length;
        previous_token = current_input_token;
    }

    while ( *( current_input_token ) == ' ' )
    {
        current_input_token++;
    }
    previous_token = current_input_token;

    if ( ( *( current_input_token ) == OBJECT_START_TOKEN ) || ( *( current_input_token ) == ARRAY_START_TOKEN ) )
    {
        /* Parse through entire input */
        while ( current_input_token < end_of_input )
        {
            switch ( *current_input_token )
            {
                /* This is a start of object token */
                case OBJECT_START_TOKEN:

                    if ( escape_token )
                    {
                        escape_token = false;
                        break;
                    }

                    /* Skip in case we're parsing a string value */
                    if ( ( string_start != NULL ) && ( string_end == NULL ) )
                    {
                        break;
                    }

                    /* In case the json is split across packets, record the most recent object market
                     * and copy from this point forward
                     */
                    most_recent_object_marker = current_input_token;

                    /* Keep track of the number of objects open */
                    object_counter++;

                    type = JSON_OBJECT_TYPE;
                    /* If we have already captured some string value, then this string must represent the name of this object */
                    if ( string_end )
                    {
                        /* prepare JSON object. The object string was already piced up by the start of value token */
                        json_object.value_type = type;
                        json_object.value = NULL;
                        json_object.value_length = 0;

                        /* Reset the string and value pointers */
                        string_start = NULL;
                        string_end = NULL;
                        value_start = NULL;
                        value_end = NULL;
                    }

                    if ( ( ( json_object.value_type == JSON_ARRAY_TYPE ) || ( json_object.value_type == JSON_OBJECT_TYPE ) ) && ( parent_counter < MAX_PARENTS ) )
                    {
                        parent_json_object[ parent_counter ] = json_object;
                        json_object.parent_object = &parent_json_object[ parent_counter ];
                        parent_counter++;
                    }
                    else if ( *previous_token == COMMA_SEPARATOR )
                    {
                        json_object.parent_object = &parent_json_object[ parent_counter ];
                        parent_counter++;
                    }
                    previous_token = current_input_token;

                    break;

                /* This is an end of object token */
                case OBJECT_END_TOKEN:

                    if ( escape_token )
                    {
                        escape_token = false;
                        break;
                    }

                    /* Skip in case we're parsing a string value */
                    if ( ( string_start != NULL ) && ( string_end == NULL ) )
                    {
                        break;
                    }

                    object_counter--;

                    if ( *( previous_token ) == COMMA_SEPARATOR )
                    {
                        if ( *( current_input_token ) == ( OBJECT_END_TOKEN ) )
                        {
                            valid_json_string = CY_RSLT_JSON_GENERIC_ERROR;
                            object_counter = 0;
                            array_counter = 0;
                            return valid_json_string;
                        }
                    }
                    /* Extract final value in object list. If we have already marked the beginning of a value, than this must be final value in object list */
                    if ( value_start )
                    {
                        value_end = current_input_token;
                        /* If previous was a string token, then this must be a string value */
                        if ( *previous_token == STRING_TOKEN )
                        {
                            type = JSON_STRING_TYPE;

