HHyeon/stm32-connectivity/Projects/STM32H747I-DISCO/Applications/wifi_scan/Middlewares/Third_Party/Infineon_Wireless_Connectivity/connectivity-utilities/JSON_parser/cy_json_parser.c
                            /* Move value token to point prior to string token and to last character of string value*/
                            value_end = previous_token - 1;
                            value_start = string_start + 1;
                        }
                        else if ( *previous_token == TRUE_TOKEN )
                        {
                            type = JSON_BOOLEAN_TYPE;

                            value_end = previous_token + sizeof( "true" ) - 2;
                            value_start = previous_token;
                        }
                        else if ( *previous_token == FALSE_TOKEN )
                        {
                            type = JSON_BOOLEAN_TYPE;

                            value_end = previous_token + sizeof( "false" ) - 2;
                            value_start = previous_token;
                        }
                        else if ( *previous_token == NULL_TOKEN )
                        {
                            type = JSON_NULL_TYPE;
                            value_end = previous_token + sizeof( "null" ) - 2;
                            value_start = previous_token;
                        }
                        else
                        {
                            char*   start = NULL;
                            char*   end = NULL;
                            uint8_t len = 0;
                            /* This must be a number value if not string. Arrays would have been picked up already by the end of array token */
                            type = JSON_NUMBER_TYPE;

                            end = value_end;

                            start = previous_token;
                            start++;
                            end--;
                            while ( *end == ' ' )
                            {
                                end--;
                            }
                            while ( *start == ' ' )
                            {
                                start++;
                            }

                            len = end - start + 1;

                            if ( validate_array_value( start, end, len ) != CY_RSLT_SUCCESS )
                            {
                                valid_json_string = CY_RSLT_JSON_GENERIC_ERROR;
                                object_counter = 0;
                                array_counter = 0;
                                return valid_json_string;
                            }

                            /* Keep moving the value end token back till you encounter a digit */
                            while ( ( *value_end < '0' ) || ( *value_end > '9' ) )
                            {
                                value_end--;
                            }

                            /* Initialise the value_start token with value_end */
                            value_start = value_end;

                            /* Move value_start token until we encounter a non-digit value */
                            while ( ( ( *value_start >= '0' ) && ( *value_start <= '9' ) ) || ( *value_start == '.' ) || ( *value_start == '-' ) )
                            {
                                value_start--;
                            }

                            /*Point to first number */
                            value_start++;
                        }

                        /* Prepare JSON object */
                        json_object.value_type = type;
                        json_object.value = value_start;
                        json_object.value_length = value_end - value_start + 1;

                        if ( internal_json_callback != NULL )
                        {
                            internal_json_callback( &json_object, internal_json_argument );
                        }

                        /* Reset the value pointers */
                        value_start = NULL;
                        value_end = NULL;
                        string_start = NULL;
                        string_end = NULL;
                        type = UNKNOWN_JSON_TYPE;
                    }
                    if ( parent_counter )
                    {
                        parent_counter--;

                        if ( parent_counter )
                        {
                            json_object.parent_object = &parent_json_object[ parent_counter - 1 ];
                        }
                        else
                        {
                            json_object.parent_object = &parent_json_object[ parent_counter ];
                        }
                    }
                    else
                    {
                        json_object.parent_object = NULL;
                    }
                    previous_token = current_input_token;

                    break;

                case STRING_TOKEN:

                    if ( escape_token )
                    {
                        escape_token = false;
                        break;
                    }
                    /* This indicates this must be closing token for object name */
                    if ( *previous_token == STRING_TOKEN )
                    {
                        /* Get the last character of the string name */
                        string_end = current_input_token;
                    }
                    else
                    {
                        /* Find start and end of of object name */
                        string_start = current_input_token;
                        string_end = NULL;
                    }
                    previous_token = current_input_token;

                    break;

                case TRUE_TOKEN:
                    if ( escape_token )
                    {
                        escape_token = false;
                        break;
                    }
                    if ( *previous_token == OBJECT_START_TOKEN )
                    {
                        valid_json_string = CY_RSLT_JSON_GENERIC_ERROR;
                        object_counter = 0;

