HHyeon/stm32-connectivity/Projects/STM32H747I-DISCO/Applications/wifi_scan/Middlewares/Third_Party/Infineon_Wireless_Connectivity/connectivity-utilities/JSON_parser/cy_json_parser.c
                        return valid_json_string;
                    }
                    if ( ( *previous_token == START_OF_VALUE ) && ( string_end ) )
                    {
                        previous_token = current_input_token;
                        current_input_token = current_input_token + sizeof( "true" ) - 2;
                    }

                    break;

                case FALSE_TOKEN:
                    if ( escape_token )
                    {
                        escape_token = false;
                        break;
                    }
                    if ( *previous_token == OBJECT_START_TOKEN )
                    {
                        valid_json_string = CY_RSLT_JSON_GENERIC_ERROR;
                        object_counter = 0;
                        array_counter = 0;
                        return valid_json_string;
                    }
                    if ( ( *previous_token == START_OF_VALUE ) && ( string_end ) )
                    {
                        /* Skip ahead as this must be boolean false */
                        previous_token = current_input_token;
                        current_input_token = current_input_token + sizeof( "false" ) - 2;
                    }
                    break;

                case NULL_TOKEN:
                    if ( escape_token )
                    {
                        escape_token = false;
                        break;
                    }
                    if ( ( *previous_token == START_OF_VALUE ) && ( string_end ) )
                    {
                        previous_token = current_input_token;
                        current_input_token = current_input_token + sizeof( "null" ) - 2;
                    }
                    break;

                case ARRAY_START_TOKEN:

                    if ( escape_token )
                    {
                        escape_token = false;
                        break;
                    }

                    /* Skip in case we're parsing a string value */
                    if ( ( string_start != NULL ) && ( string_end == NULL ) )
                    {
                        break;
                    }
                    else if (string_start == NULL)
                    {
                        json_object.object_string = NULL;
                        json_object.object_string_length = 0;
                    }

                    array_counter++;
                    /*This means the last object name must have an array value type*/
                    type = JSON_ARRAY_TYPE;

                    json_object.value_type = type;
                    json_object.value = NULL;
                    json_object.value_length = 0;

                    if ( internal_json_callback != NULL )
                    {
                        internal_json_callback( &json_object, internal_json_argument );
                    }

                    /* Reset object string start/end tokens */
                    string_start = NULL;
                    string_end = NULL;

                    previous_token = current_input_token;

                    break;

                case ARRAY_END_TOKEN:

                    if ( escape_token )
                    {
                        escape_token = false;
                        break;
                    }

                    /* Skip in case we're parsing a string value */
                    if ( ( string_start != NULL ) && ( string_end == NULL ) )
                    {
                        break;
                    }

                    array_counter--;


                    if ( *( previous_token ) == START_OF_VALUE )
                    {
                        valid_json_string = CY_RSLT_JSON_GENERIC_ERROR;
                        object_counter = 0;
                        return valid_json_string;
                    }

                    if ( *( current_input_token - space - 1 ) == COMMA_SEPARATOR )
                    {
                        valid_json_string = CY_RSLT_JSON_GENERIC_ERROR;
                        object_counter = 0;
                        array_counter = 0;
                        return valid_json_string;
                    }

                    /* Ignore comma separators in values */
                    if ( ( string_start ) && ( string_end == NULL ) )
                    {
                        break;
                    }
                    /* If this comma is within an array, it must be delimiting values, so extract the comma delimited value */
                    else if ( type == JSON_ARRAY_TYPE )
                    {
                        /* If the token prior to the comma was a string token, then the delimited value must be a string */
                        if ( *previous_token == STRING_TOKEN )
                        {
                            type = JSON_STRING_TYPE;

                            /* Move token to point prior to string token and to last character of string value*/
                            value_end = previous_token - 1;
                            value_start = string_start + 1;
                        }
                        else if ( *previous_token == TRUE_TOKEN )
                        {
                            type = JSON_BOOLEAN_TYPE;

                            value_end = previous_token + sizeof( "true" ) - 2;
                            value_start = previous_token;
                        }
                        else if ( *previous_token == FALSE_TOKEN )
                        {
                            type = JSON_BOOLEAN_TYPE;

                            value_end = previous_token + sizeof( "false" ) - 2;
                            value_start = previous_token;
                        }
                        else if ( *previous_token == NULL_TOKEN )
                        {
                            type = JSON_NULL_TYPE;
                            value_end = previous_token + sizeof( "null" ) - 2;
                            value_start = previous_token;
                        }
                        else
                        {
                            char*   start = NULL;
                            char*   end = NULL;
                            uint8_t len = 0;
                            /* Delimited values must be a NUMBER if they are not a string */
                            type = JSON_NUMBER_TYPE;

                            /* Set value_end to point to current location */
                            value_end = current_input_token;

                            /* This must be a number value if not string. Arrays would have been picked up already by the end of array token */
                            type = JSON_NUMBER_TYPE;

                            end = value_end;

                            start = previous_token;
                            start++;
                            end--;
                            while ( *end == ' ' )
                            {
                                end--;
                            }
                            while ( *start == ' ' )
                            {
                                start++;
                            }

                            len = end - start + 1;

