HHyeon/stm32-connectivity/Projects/STM32H747I-DISCO/Applications/wifi_scan/Middlewares/Third_Party/Infineon_Wireless_Connectivity/connectivity-utilities/JSON_parser/cy_json_parser.c
                            /*Point to first number */
                            value_start++;
                        }

                        /* prepare JSON object */
                        json_object.object_string = NULL;
                        json_object.object_string_length = 0;
                        json_object.value_type = type;
                        json_object.value = value_start;
                        json_object.value_length = value_end - value_start + 1;

                        if ( internal_json_callback != NULL )
                        {
                            internal_json_callback( &json_object, internal_json_argument );
                        }
                        value_start = NULL;
                        value_end = NULL;
                        string_start = NULL;
                        string_end = NULL;
                        type = JSON_ARRAY_TYPE;
                    }
                    else if ( value_start )
                    {
                        value_end = current_input_token;

                        /* Commas are only used to seperate values so this must indicate an end of value, which means last object information is for us */
                        if ( *previous_token == STRING_TOKEN )
                        {
                            type = JSON_STRING_TYPE;

                            value_end = previous_token - 1;
                            value_start = string_start + 1;
                        }
                        else if ( *previous_token == ARRAY_END_TOKEN )
                        {
                            if ( string_start )
                            {
                                type = JSON_STRING_TYPE;
                                value_start = string_start + 1;
                                value_end = string_end - 1;
                            }
                            else
                            {
                                type = JSON_NUMBER_TYPE;

                                /* Keep moving the value end token back till you encounter a digit */
                                while ( ( *value_end < '0' ) || ( *value_end > '9' ) )
                                {
                                    value_end--;
                                }

                                value_start = value_end;

                                while ( ( *value_start >= '0' ) && ( *value_start <= '9' ) )
                                {
                                    value_start--;
                                }

                                value_start++;
                            }
                        }
                        else if ( *previous_token == TRUE_TOKEN )
                        {
                            type = JSON_BOOLEAN_TYPE;

                            value_end = previous_token + sizeof( "true" ) - 2;
                            value_start = previous_token;
                        }
                        else if ( *previous_token == FALSE_TOKEN )
                        {
                            type = JSON_BOOLEAN_TYPE;

                            value_end = previous_token + sizeof( "false" ) - 2;
                            value_start = previous_token;
                        }
                        else if ( *previous_token == NULL_TOKEN )
                        {
                            type = JSON_NULL_TYPE;
                            value_end = previous_token + sizeof( "null" ) - 2;
                            value_start = previous_token;
                        }
                        else
                        {
                            type = JSON_NUMBER_TYPE;

                            /* Keep moving the value end token back till you encounter a digit */
                            while ( ( ( *value_end < '0' ) || ( *value_end > '9' ) ) )
                            {
                                value_end--;
                            }

                            value_start = value_end;

                            while ( ( ( *value_start >= '0' ) && ( *value_start <= '9' ) ) || ( *value_start == '.' ) || ( *value_start == '-' ) )
                            {
                                value_start--;
                            }

                            value_start++;
                        }

                        json_object.value_type = type;
                        json_object.value = value_start;
                        json_object.value_length = value_end - value_start + 1;

                        if ( internal_json_callback != NULL )
                        {
                            internal_json_callback( &json_object, internal_json_argument );
                        }

                        string_start = NULL;
                        string_end = NULL;
                        value_start = NULL;
                        value_end = NULL;
                        type = UNKNOWN_JSON_TYPE;
                    }

                    previous_token = current_input_token;

                    break;

                case ESCAPE_TOKEN:
                    /* Clear escape token flag, if the previous token is an escape token. Else set it */
                    escape_token = ( escape_token == true ) ? false : true;

                    break;

                default:
                    /* Reset escape token flag */
                    escape_token = false;
                    if ( ( object_counter == 0 ) && ( array_counter == 0 ) && ( *current_input_token  != ' ' ) &&
                         ( JSON_IS_NOT_ESC_CHAR ( *current_input_token ) ) )
                    {
                        valid_json_string = CY_RSLT_JSON_GENERIC_ERROR;
                        object_counter = 0;
                        array_counter = 0;
                        return valid_json_string;
                    }
                    break;
            } // switch

            /* Counting spaces*/
            if ( *( current_input_token ) == ' ' )
            {
                space++;
            }
            else
            {
                space = 0;
            }
            current_input_token++;
            if ( ( *( current_input_token ) == '\0' ) && ( ( ( *( previous_token ) == COMMA_SEPARATOR ) || ( *( previous_token ) == STRING_TOKEN ) || ( *( previous_token ) == START_OF_VALUE ) || ( *( previous_token ) == ARRAY_START_TOKEN ) ) ) )
            {
                valid_json_string = CY_RSLT_JSON_GENERIC_ERROR;
                object_counter = 0;
                array_counter = 0;
                return valid_json_string;
            }
        } // while
    }     // if
    else
    {
        valid_json_string = CY_RSLT_JSON_GENERIC_ERROR;
        return valid_json_string;
    }

    /* This means that a closing brace has not been found for an object. This data is split across packets */
    if ( object_counter || array_counter )
    {
        memset( packet_backup, 0x0, sizeof( packet_backup ) );

        // Copy everything from the most recent unfinished object onwards

        number_of_bytes_backed_up = end_of_input - most_recent_object_marker;

        memcpy( packet_backup, most_recent_object_marker, number_of_bytes_backed_up );


        incomplete_response = true;
        valid_json_string = CY_RSLT_JSON_GENERIC_ERROR;
        object_counter      = 0;

        return valid_json_string;
    }


    memset( &parent_json_object, 0x0, sizeof( parent_json_object ) );

    incomplete_response = false;

    object_counter      = 0;

    string_start        = NULL;
    string_end          = NULL;

    value_start         = NULL;
    value_end           = NULL;

    type                = UNKNOWN_JSON_TYPE;

    escape_token        = false;

    previous_token      = NULL;

    return valid_json_string;
}
